2-CaseFiles/case22/parameterized/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;


//Parameters
        X0      #calc "-1.0"; 
        Y0      #calc "1*$X0";
        X1      #calc "-1*$X0";
        Y1      #calc "1*$X0";
        X2      #calc "-1*$X0";
        Y2      #calc "-1*$X0";
        X3      #calc "1*$X0";
        Y3      #calc "-1*$Y0";
        
        X4      #calc "0.25*$X0"; 
        Y4      #calc "0.25*$X0";
        X5      #calc "-0.25*$X0";
        Y5      #calc "0.25*$X0";       
        X6      #calc "-0.25*$X0";
        Y6      #calc "-0.25*$X0";
        X7      #calc "0.25*$X0";
        Y7      #calc "-0.25*$X0";

        Z1  0;    
        Z2  -2.0;
	Z3  4.0;


/*vertices
(
    (-1 -1 0) //0
    (1 -1 0) //1
    (1 1 0) //2
    (-1 1 0) //3
    (-0.25 -0.25 0) //4
    (0.25 -0.25 0) //5
    (0.25 0.25  0) //6
    (-0.25 0.25 0) //7
    (-1 -1 4) //8
    (1 -1 4) //9
    (1 1 4) //10
    (-1 1 4) //11
    (-0.25 -0.25 4) //12
    (0.25 -0.25 4) //13
    (0.25 0.25  4) //14
    (-0.25 0.25 4) //15
    (-0.25 -0.25 -2) //16
    (0.25 -0.25 -2) //17
    (0.25 0.25  -2) //18
    (-0.25 0.25 -2) //19
)*/

vertices
(
    ($X0 $Y0 $Z1) //0
    ($X1 $Y1 $Z1)//1
    ($X2 $Y2 $Z1)//2
    ($X3 $Y3 $Z1) //3
    ($X4 $Y4 $Z1)//4
    ($X5 $Y5 $Z1)//5
    ($X6 $Y6 $Z1) //6
    ($X7 $Y7 $Z1) //7

    ($X0 $Y0 $Z3) //8
    ($X1 $Y1 $Z3)//9
    ($X2 $Y2 $Z3)//10
    ($X3 $Y3 $Z3) //11
    ($X4 $Y4 $Z3)//12
    ($X5 $Y5 $Z3)//13
    ($X6 $Y6 $Z3) //14
    ($X7 $Y7 $Z3) //15
    
    ($X4 $Y4 $Z2)//16
    ($X5 $Y5 $Z2)//17
    ($X6 $Y6 $Z2) //18
    ($X7 $Y7 $Z2) //19

);

    n0	4;
    n1	5;
    n2	10;
    n3	15;

/*blocks
(

    hex (0 1 5 4 8 9 13 12) (5 4 15) simpleGrading (1 1 1) //B0
    hex (5 1 2 6 13 9 10 14) (4 5 15) simpleGrading (1 1 1) //B1
    hex (7 6 2 3 15 14 10 11) (5 4 15) simpleGrading (1 1 1) //B2
    hex (0 4 7 3 8 12 15 11) (4 5 15) simpleGrading (1 1 1) //B3
    hex (4 5 6 7 12 13 14 15) (5 5 15) simpleGrading (1 1 1) //B4
    hex (16 17 18 19 4 5 6 7) (5 5 10) simpleGrading (1 1 1) //B5
)*/

blocks
(
    hex (0 1 5 4 8 9 13 12) ($n1 $n0 $n3) simpleGrading (1 1 1) //B0
    hex (5 1 2 6 13 9 10 14) ($n0 $n1 $n3) simpleGrading (1 1 1) //B1
    hex (7 6 2 3 15 14 10 11) ($n1 $n0 $n3) simpleGrading (1 1 1) //B2
    hex (0 4 7 3 8 12 15 11) ($n0 $n1 $n3) simpleGrading (1 1 1) //B3
    hex (4 5 6 7 12 13 14 15) ($n1 $n1 $n3) simpleGrading (1 1 1) //B4
    hex (16 17 18 19 4 5 6 7) ($n1 $n1 $n2) simpleGrading (1 1 1) //B5
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (16 17 18 19)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 9 13 12)
            (13 9 10 14)
            (15 14 10 11)
            (8 12 15 11)
            (12 13 14 15)
        );
    }
    tube
    {
        type wall;
        faces
        (
            (16 17 5 4)
            (17 18 6 5)
            (19 7 6 18)
            (19 16 4 7)
        );
    }
    tank
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (5 1 2 6)
            (7 6 2 3)
            (0 4 7 3)
            (0 1 9 8)
            (1 2 10 9)
            (2 3 11 10)
            (3 0 8 11)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
